# SeparationNotAtJunction Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..MEPCalculationFailures..::..SeparationNotAtJunction Property
BuiltInFailures..::..MEPCalculationFailures Class See Also
---
This hydraulic loop is not separated at any junction. Use the Remove Separation tool to clean up undesired hydraulic separations.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId SeparationNotAtJunction { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SeparationNotAtJunction As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ SeparationNotAtJunction {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..MEPCalculationFailures Class
Autodesk.Revit.DB Namespace